bench/trimbench/res.xfs.discard.swraid.crucial.linux65.socket2/o.test.out
Create /data/m/f.1 at Mon Jun 17 04:31:09 PM UTC 2024
1048576+0 records in
1048576+0 records out
1099511627776 bytes (1.1 TB, 1.0 TiB) copied, 3179.38 s, 346 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 1.0T Jun 17 17:24 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Mon Jun 17 05:24:09 PM UTC 2024
stat: cannot statx '/data/m/f.2': No such file or directory
run.sh: line 27: [: -lt: unary operator expected
Existing /data/m/f.2 is large enough
Create /data/m/f.2 then sleep for 30 seconds at Mon Jun 17 05:24:40 PM UTC 2024
32768+0 records in
32768+0 records out
34359738368 bytes (34 GB, 32 GiB) copied, 99.1412 s, 347 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 32G Jun 17 17:26 /data/m/f.2
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=32720388k,nr_inodes=8180097,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=20760)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
ramfs on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/dev/sdb on /data2 type ext4 (rw,noatime,nodiratime,discard)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=6557224k,nr_inodes=1639306,mode=700,uid=1000,gid=1000,inode64)
/dev/md0 on /data type xfs (rw,relatime,attr2,discard,inode64,logbufs=8,logbsize=32k,sunit=1024,swidth=2048,noquota)

Remove /data/m/f.1 at Mon Jun 17 05:26:50 PM UTC 2024
Start fio to read from /data/m/f.2 at Mon Jun 17 05:26:50 PM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=1013937: Mon Jun 17 17:28:20 2024
  read: IOPS=137k, BW=537MiB/s (563MB/s)(47.2GiB/90001msec)
    slat (nsec): min=1802, max=57899, avg=3014.38, stdev=1034.47
    clat (usec): min=7, max=108223, avg=52.64, stdev=291.20
     lat (usec): min=10, max=108253, avg=55.74, stdev=291.31
    clat percentiles (usec):
     |  1.00th=[   42],  5.00th=[   44], 10.00th=[   45], 20.00th=[   46],
     | 30.00th=[   47], 40.00th=[   48], 50.00th=[   49], 60.00th=[   50],
     | 70.00th=[   51], 80.00th=[   52], 90.00th=[   55], 95.00th=[   57],
     | 99.00th=[   67], 99.50th=[   73], 99.90th=[   92], 99.95th=[  126],
     | 99.99th=[17433]
   bw (  KiB/s): min= 1408, max=616696, per=100.00%, avg=570775.35, stdev=135606.95, samples=173
   iops        : min=  352, max=154174, avg=142693.79, stdev=33901.72, samples=173
  lat (usec)   : 10=0.01%, 20=0.01%, 50=63.89%, 100=36.04%, 250=0.03%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=16.35%, sys=54.39%, ctx=3439269, majf=1, minf=35
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=12368075,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=537MiB/s (563MB/s), 537MiB/s-537MiB/s (563MB/s-563MB/s), io=47.2GiB (50.7GB), run=90001-90001msec

Disk stats (read/write):
    md0: ios=12355173/37, merge=0/0, ticks=594336/0, in_queue=594336, util=96.61%, aggrios=6184037/14, aggrmerge=0/6, aggrticks=297098/3, aggrin_queue=303864, aggrutil=96.02%
  nvme0n1: ios=6183845/14, merge=0/7, ticks=297462/2, in_queue=304170, util=96.02%
  nvme1n1: ios=6184230/15, merge=0/5, ticks=296735/4, in_queue=303558, util=94.13%

run.sh: line 58: kill: (1013909) - No such process